app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("created_at", "email", "first_name", "landline", "last_name", "mobile", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "twitter", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @contact = Contact.find(params[:id])

    respond_to do |format|
      if @contact.update_attributes(params[:contact])
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", "83"]]
UPDATE "contacts" SET "photo_file_name" = 'Screenshot_from_2013-04-16_11_50_08.png', "photo_content_type" = 'image/png', "photo_file_size" = 481737, "photo_updated_at" = '2013-07-08 17:16:33.654202', "updated_at" = '2013-07-08 17:16:34.149667' WHERE "contacts"."id" = 45